Revit 2027 API
BuiltInFailures.DimensionFailures.LinearDimensionReferenceNotOrthogonalToView Property
 The planes of one or more references are not exactly orthogonal to this view. The dimension to these reference cannot be created.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId LinearDimensionReferenceNotOrthogonalToView { get; }
Public Shared ReadOnly Property LinearDimensionReferenceNotOrthogonalToView As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ LinearDimensionReferenceNotOrthogonalToView {
	FailureDefinitionId^ get ();
}
static member LinearDimensionReferenceNotOrthogonalToView : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.DimensionFailures Class
Autodesk.Revit.DB Namespace